---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.ViewFailures
source: html/aecb2f96-7e0e-0763-3663-842e06d9165c.htm
---
# BuiltInFailures.ViewFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.